# Вычислить число Пи c заданной точностью d
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001
# !!ВНИМАНИЕ
# !!! не использовать константу math.pi

import math

d = input('Введите значение - точность определения числа Пи: ')
n = 10000000  # ряд Лейбница
sum1 = 0
sum2 = 0
totalpi = 0
for i in range(1, n + 1, 4):
    sum1 += 1 / i
for i in range(3, n + 1, 4):
    sum2 += - 1 / i
totalpi = 4 * (sum1 + sum2)
print(f'Число Пи с точностью {d}: ')
print(round(totalpi,len(d)-2))